Revit 2027 API
CoordinationModelLinkUtils.IsCoordinationModelInstance Method
 Checks whether an element is a Coordination Model instance.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsCoordinationModelInstance(
	Document document,
	Element element
)
Public Shared Function IsCoordinationModelInstance (
	document As Document,
	element As Element
) As Boolean
public:
static bool IsCoordinationModelInstance(
	Document^ document,
	Element^ element
)
static member IsCoordinationModelInstance :
        document : Document *
        element : Element -> bool
Parameters
document Document
 The document.
element Element
 The element to check.
Return Value
Boolean
 True if the element is Coordination Model instance; false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CoordinationModelLinkUtils Class
Autodesk.Revit.DB.ExternalData Namespace